---
type: FailuresProcessingEventArgs
namespace: Autodesk.Revit.DB.Events
version: 2024
members: 3
tags: [revit-api, class]
---

# FailuresProcessingEventArgs

`Autodesk.Revit.DB.Events.FailuresProcessingEventArgs` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetFailuresAccessor | 2011 | `public FailuresAccessor GetFailuresAccessor ()` |
| Method | GetProcessingResult | 2011 | `public FailureProcessingResult GetProcessingResult ()` |
| Method | SetProcessingResult | 2011 | `public void SetProcessingResult ( FailureProcessingResult result )` |